#include <stdio.h>
//数组：一组相同类型的元素集合
// 指针变量：是一个变量，存放的是地址 
int main()
{
    int arr[10] = { 0 };
    int *p = arr; // 数组名作为指针使用，指向数组首元素
    int sz = sizeof(arr) / sizeof(arr[0]); // 计算数组元素个数
    int num = 0;
    for (int i = 0; i < sz; i++)
    {
        printf("%d ", *(p + i)); // 使用指针访问数组元素
        num += *(p + i); // 累加数组元素
    }
    printf("\n");
    for (int i = 0; i < sz; i++)
    {
        printf("%p------%p\n",&arr[i],p+i);
    }
    return 0;
// 0 0 0 0 0 0 0 0 0 0 
// 00000000005FFE80------00000000005FFE80
// 00000000005FFE84------00000000005FFE84
// 00000000005FFE88------00000000005FFE88
// 00000000005FFE8C------00000000005FFE8C
// 00000000005FFE90------00000000005FFE90
// 00000000005FFE94------00000000005FFE94
// 00000000005FFE98------00000000005FFE98
// 00000000005FFE9C------00000000005FFE9C
// 00000000005FFEA0------00000000005FFEA0
// 00000000005FFEA4------00000000005FFEA4
//一模一样
    
}